Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 50)                1040600   
_________________________________________________________________
dense_1 (Dense)              (None, 6)                 306       
=================================================================
Total params: 1,040,906
Trainable params: 1,040,906
Non-trainable params: 0
_________________________________________________________________
