Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_13 (Dense)             (None, 150)               3121800   
_________________________________________________________________
dense_14 (Dense)             (None, 6)                 906       
=================================================================
Total params: 3,122,706
Trainable params: 3,122,706
Non-trainable params: 0
_________________________________________________________________
