Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_19 (Dense)             (None, 150)               3121800   
_________________________________________________________________
dense_20 (Dense)             (None, 150)               22650     
_________________________________________________________________
dense_21 (Dense)             (None, 150)               22650     
_________________________________________________________________
dense_22 (Dense)             (None, 150)               22650     
_________________________________________________________________
dense_23 (Dense)             (None, 150)               22650     
_________________________________________________________________
dense_24 (Dense)             (None, 150)               22650     
_________________________________________________________________
dense_25 (Dense)             (None, 6)                 906       
=================================================================
Total params: 3,235,956
Trainable params: 3,235,956
Non-trainable params: 0
_________________________________________________________________
