Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_15 (Dense)             (None, 150)               3121800   
_________________________________________________________________
dense_16 (Dense)             (None, 150)               22650     
_________________________________________________________________
dense_17 (Dense)             (None, 150)               22650     
_________________________________________________________________
dense_18 (Dense)             (None, 6)                 906       
=================================================================
Total params: 3,168,006
Trainable params: 3,168,006
Non-trainable params: 0
_________________________________________________________________
